project-chip/connectedhomeip/examples/all-devices-app/esp32/main/main.cpp
/*
 *
 *    Copyright (c) 2025-2026 Project CHIP Authors
 *    All rights reserved.
 *
 *    Licensed under the Apache License, Version 2.0 (the "License");
 *    you may not use this file except in compliance with the License.
 *    You may obtain a copy of the License at
 *
 *        http://www.apache.org/licenses/LICENSE-2.0
 *
 *    Unless required by applicable law or agreed to in writing, software
 *    distributed under the License is distributed on an "AS IS" BASIS,
 *    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *    See the License for the specific language governing permissions and
 *    limitations under the License.
 */

#include <ESP32DimmableLight.h>
#include <app/DefaultSafeAttributePersistenceProvider.h>
#include <app/InteractionModelEngine.h>
#include <app/SafeAttributePersistenceProvider.h>
#include <app/TestEventTriggerDelegate.h>
#include <app/persistence/DefaultAttributePersistenceProvider.h>
#include <app/server/Dnssd.h>
#include <app/server/Server.h>
#include <credentials/DeviceAttestationCredsProvider.h>
#include <credentials/examples/DeviceAttestationCredsExample.h>
#include <device-factory/DeviceFactory.h>
#include <device/api/allocator/ConsecutiveEndpointIdAllocator.h>
#include <device/api/allocator/DynamicEndpointIdAllocator.h>
#include <device/capabilities/identify/LoggingIdentifyDelegate.h>
#include <device/types/root-node/WifiRootNode.h>
#include <esp_heap_caps.h>
#include <esp_log.h>
#include <esp_system.h>
#include <freertos/FreeRTOS.h>
#include <freertos/task.h>
#include <nvs_flash.h>
#include <oob-accessors/OOBAccessorRegistry.h>
#include <platform/DiagnosticDataProvider.h>
#include <platform/ESP32/ESP32Config.h>
#include <platform/ESP32/ESP32Utils.h>
#include <platform/ESP32/NetworkCommissioningDriver.h>
#include <platform/PlatformManager.h>
#include <setup_payload/OnboardingCodesUtil.h>

#include <app_config/enabled_devices.h>

#include <cctype>
#include <memory>
#include <string>
#include <vector>

#if CONFIG_HAVE_DISPLAY
#include "DeviceDisplay.h"
#include "Display.h"
#include "ScreenManager.h"
#endif // CONFIG_HAVE_DISPLAY

#if CONFIG_ENABLE_CHIP_SHELL
#include <DeviceShellCommands.h>
#include <lib/shell/commands/WiFi.h>
#include <shell_extension/launch.h>
#endif

#ifdef CONFIG_USE_BLE_ONLY_FOR_COMMISSIONING
#include <platform/internal/BLEManager.h>
#endif

#if CONFIG_ENABLE_OTA_REQUESTOR
#include <ota/OTAHelper.h>
#endif

#if CONFIG_ENABLE_ESP32_FACTORY_DATA_PROVIDER
#include <platform/ESP32/ESP32FactoryDataProvider.h>
#endif // CONFIG_ENABLE_ESP32_FACTORY_DATA_PROVIDER

#if CONFIG_ENABLE_ESP32_DEVICE_INFO_PROVIDER
#include <platform/ESP32/ESP32DeviceInfoProvider.h>
#else
#include <DeviceInfoProviderImpl.h>
#endif // CONFIG_ENABLE_ESP32_DEVICE_INFO_PROVIDER

using namespace chip;
using namespace chip::app;
using namespace chip::DeviceLayer;
using namespace chip::Credentials;
using chip::DeviceLayer::Internal::ESP32Config;

static const char TAG[] = "all-devices-app";

// NVS key for storing the device type across reboots
static const ESP32Config::Key kConfigKey_DeviceType{ ESP32Config::kConfigNamespace_ChipConfig, "dev-type" };
static std::string gDeviceType;
static const size_t kMaxDeviceTypeLength = 64;

#include "DeviceFactoryPlatformOverride.h"

namespace {

std::string KebabCaseToTitleCase(const std::string & input)
{
    std::string output  = input;
    bool capitalizeNext = true;
    for (char & c : output)
    {
        if (c == '-')
        {
            c              = ' ';
            capitalizeNext = true;
        }
        else if (capitalizeNext)
        {
            c              = static_cast<char>(std::toupper(static_cast<unsigned char>(c)));
            capitalizeNext = false;
        }
    }
    return output;
}

// Use the singleton - platform event handlers report to GetInstance()
DeviceLayer::NetworkCommissioning::ESPWiFiDriver & sWiFiDriver = DeviceLayer::NetworkCommissioning::ESPWiFiDriver::GetInstance();

#if CONFIG_ENABLE_ESP32_FACTORY_DATA_PROVIDER
DeviceLayer::ESP32FactoryDataProvider sFactoryDataProvider;
#endif // CONFIG_ENABLE_ESP32_FACTORY_DATA_PROVIDER

#if CONFIG_ENABLE_ESP32_DEVICE_INFO_PROVIDER
DeviceLayer::ESP32DeviceInfoProvider gExampleDeviceInfoProvider;
#else
DeviceLayer::DeviceInfoProviderImpl gExampleDeviceInfoProvider;
#endif // CONFIG_ENABLE_ESP32_DEVICE_INFO_PROVIDER

chip::app::DefaultAttributePersistenceProvider gAttributePersistenceProvider;
chip::app::DefaultSafeAttributePersistenceProvider gSafeAttributePersistenceProvider;
Credentials::GroupDataProviderImpl gGroupDataProvider;
LoggingIdentifyDelegate gIdentifyDelegate;
chip::app::CodeDrivenDataModelProvider * gDataModelProvider = nullptr;
std::unique_ptr<DeviceInterface> gRootNode;
std::vector<std::unique_ptr<DeviceInterface>> gConstructedDevices;
std::vector<std::unique_ptr<OOBAccessor>> gConstructedAccessors;
DefaultTimerDelegate gTimerDelegate;

void DeInitBLEIfCommissioned()
{
#ifdef CONFIG_USE_BLE_ONLY_FOR_COMMISSIONING
    static bool bleAlreadyShutdown = false;
    if (chip::Server::GetInstance().GetFabricTable().FabricCount() > 0 && !bleAlreadyShutdown)
    {
        bleAlreadyShutdown = true;
        chip::DeviceLayer::Internal::BLEMgr().Shutdown();
    }
#endif
}

void DeviceEventHandler(const DeviceLayer::ChipDeviceEvent * event, intptr_t arg)
{
    switch (event->Type)
    {
    case DeviceLayer::DeviceEventType::kBLEDeinitialized:
        ESP_LOGI(TAG, "BLE is deinitialized");
        break;

    case DeviceLayer::DeviceEventType::kInternetConnectivityChange:
        if (event->InternetConnectivityChange.IPv4 == DeviceLayer::kConnectivity_Established)
        {
            ESP_LOGI(TAG, "IPv4 Server ready...");
            chip::app::DnssdServer::Instance().StartServer();
        }
        else if (event->InternetConnectivityChange.IPv4 == DeviceLayer::kConnectivity_Lost)
        {
            ESP_LOGE(TAG, "Lost IPv4 connectivity...");
        }
        if (event->InternetConnectivityChange.IPv6 == DeviceLayer::kConnectivity_Established)
        {
            ESP_LOGI(TAG, "IPv6 Server ready...");
            chip::app::DnssdServer::Instance().StartServer();
        }
        else if (event->InternetConnectivityChange.IPv6 == DeviceLayer::kConnectivity_Lost)
        {
            ESP_LOGE(TAG, "Lost IPv6 connectivity...");
        }
        break;

    case DeviceLayer::DeviceEventType::kCHIPoBLEConnectionEstablished:
        ESP_LOGI(TAG, "CHIPoBLE connection established");
        break;

