project-chip/connectedhomeip/examples/all-devices-app/esp32/main/main.cpp
    case DeviceLayer::DeviceEventType::kCHIPoBLEConnectionClosed:
        ESP_LOGI(TAG, "CHIPoBLE disconnected");
        break;

    case DeviceLayer::DeviceEventType::kDnssdInitialized:
#if CONFIG_ENABLE_OTA_REQUESTOR
        OTAHelpers::Instance().InitOTARequestor();
#endif
        break;

    case DeviceLayer::DeviceEventType::kCommissioningComplete:
        ESP_LOGI(TAG, "Commissioning complete");
        DeInitBLEIfCommissioned();
        break;

    case DeviceLayer::DeviceEventType::kInterfaceIpAddressChanged:
        if ((event->InterfaceIpAddressChanged.Type == DeviceLayer::InterfaceIpChangeType::kIpV4_Assigned) ||
            (event->InterfaceIpAddressChanged.Type == DeviceLayer::InterfaceIpChangeType::kIpV6_Assigned))
        {
            // MDNS server restart on any ip assignment: if link local ipv6 is configured, that
            // will not trigger a 'internet connectivity change' as there is no internet
            // connectivity. MDNS still wants to refresh its listening interfaces to include the
            // newly selected address.
            chip::app::DnssdServer::Instance().StartServer();
        }
        break;

    default:
        break;
    }

    ESP_LOGI(TAG, "Current free heap: Internal: %u/%u External: %u/%u",
             static_cast<unsigned int>(heap_caps_get_free_size(MALLOC_CAP_8BIT | MALLOC_CAP_INTERNAL)),
             static_cast<unsigned int>(heap_caps_get_total_size(MALLOC_CAP_8BIT | MALLOC_CAP_INTERNAL)),
             static_cast<unsigned int>(heap_caps_get_free_size(MALLOC_CAP_8BIT | MALLOC_CAP_SPIRAM)),
             static_cast<unsigned int>(heap_caps_get_total_size(MALLOC_CAP_8BIT | MALLOC_CAP_SPIRAM)));
}

chip::app::DataModel::Provider * PopulateCodeDrivenDataModelProvider(PersistentStorageDelegate * delegate,
                                                                     TestEventTriggerDelegate * testEventTriggerDelegate)
{
    // Initialize the attribute persistence provider with the storage delegate
    CHIP_ERROR err = gAttributePersistenceProvider.Init(delegate);
    if (err != CHIP_NO_ERROR)
    {
        ESP_LOGE(TAG, "Failed to init attribute persistence provider: %" CHIP_ERROR_FORMAT, err.Format());
        return nullptr;
    }

    // Initialize the safe attribute persistence provider with the storage delegate
    err = gSafeAttributePersistenceProvider.Init(delegate);
    if (err != CHIP_NO_ERROR)
    {
        ESP_LOGE(TAG, "Failed to init safe attribute persistence provider: %" CHIP_ERROR_FORMAT, err.Format());
        return nullptr;
    }
    SetSafeAttributePersistenceProvider(&gSafeAttributePersistenceProvider);

    static chip::app::CodeDrivenDataModelProvider dataModelProvider =
        chip::app::CodeDrivenDataModelProvider(*delegate, gAttributePersistenceProvider);

    gDataModelProvider = &dataModelProvider;

    DeviceLayer::DeviceInstanceInfoProvider * provider = DeviceLayer::GetDeviceInstanceInfoProvider();
    if (provider == nullptr)
    {
        ESP_LOGE(TAG, "Failed to get DeviceInstanceInfoProvider.");
        return nullptr;
    }

    gRootNode = std::make_unique<WifiRootNode>(
        RootNode::Context {
            .commissioningWindowManager     = Server::GetInstance().GetCommissioningWindowManager(),   //
                .configurationManager       = DeviceLayer::ConfigurationMgr(),                         //
                .deviceControlServer        = DeviceLayer::DeviceControlServer::DeviceControlSvr(),    //
                .fabricTable                = Server::GetInstance().GetFabricTable(),                  //
                .accessControl              = Server::GetInstance().GetAccessControl(),                //
                .persistentStorage          = Server::GetInstance().GetPersistentStorage(),            //
                .failSafeContext            = Server::GetInstance().GetFailSafeContext(),              //
                .deviceInstanceInfoProvider = *provider,                                               //
                .platformManager            = DeviceLayer::PlatformMgr(),                              //
                .groupDataProvider          = gGroupDataProvider,                                      //
                .sessionManager             = Server::GetInstance().GetSecureSessionManager(),         //
                .dnssdServer                = DnssdServer::Instance(),                                 //
                .deviceLoadStatusProvider   = *InteractionModelEngine::GetInstance(),                  //
                .diagnosticDataProvider     = DeviceLayer::GetDiagnosticDataProvider(),                //
                .testEventTriggerDelegate   = testEventTriggerDelegate,                                //
                .dacProvider                = *Credentials::GetDeviceAttestationCredentialsProvider(), //
                .eventManagement            = EventManagement::GetInstance(),                          //
                .timerDelegate              = gTimerDelegate,                                          //
                .minGuaranteedSubscriptionsPerFabric =
                    InteractionModelEngine::GetInstance()->GetMinGuaranteedSubscriptionsPerFabric(), //
#if CHIP_CONFIG_TERMS_AND_CONDITIONS_REQUIRED
                .termsAndConditionsProvider = TermsAndConditionsManager::GetInstance(),
#endif // CHIP_CONFIG_TERMS_AND_CONDITIONS_REQUIRED
        },
        WifiRootNode::WifiContext{
            .wifiDriver = sWiFiDriver,
        });

    ConsecutiveEndpointIdAllocator rootAllocator(kRootEndpointId);
    err = gRootNode->Register(rootAllocator, dataModelProvider);
    if (err != CHIP_NO_ERROR)
    {
        ESP_LOGE(TAG, "Failed to register root node device: %" CHIP_ERROR_FORMAT, err.Format());
        return nullptr;
    }

    auto & deviceFactory = DeviceFactory::GetInstance();
    gConstructedDevices.clear();
    gConstructedAccessors.clear();

    DynamicEndpointIdAllocator endpointIdAllocator;
    constexpr size_t kMinFreeInternalHeap = 24 * 1024;

