project-chip/connectedhomeip/examples/all-devices-app/esp32/main/main.cpp
    if (gDeviceType == "*" || gDeviceType == "aggregator")
    {
        if (deviceFactory.IsValidDevice("aggregator"))
        {
            auto aggregator = deviceFactory.Create("aggregator");
            if (aggregator == nullptr)
            {
                ESP_LOGE(TAG, "Failed to create aggregator");
                return nullptr;
            }
            EndpointId aggregatorEp = endpointIdAllocator.Allocate();
            endpointIdAllocator.ForceNext(aggregatorEp);
            ESP_LOGI(TAG, "Registering aggregator on endpoint %u", aggregatorEp);
            err = aggregator->Register(endpointIdAllocator, dataModelProvider, EndpointComposition::WithParent(kInvalidEndpointId));
            if (err != CHIP_NO_ERROR)
            {
                ESP_LOGE(TAG, "Failed to register aggregator on endpoint %u: %" CHIP_ERROR_FORMAT, aggregatorEp, err.Format());
                return nullptr;
            }
            gConstructedDevices.push_back(std::move(aggregator));

            unsigned int createdCount = 0;
            unsigned int skippedCount = 0;

            for (const auto & deviceType : deviceFactory.SupportedDeviceTypes())
            {
                if (deviceType == "aggregator" || deviceType == "bridged-node")
                {
                    continue;
                }

                size_t freeInternalHeap = heap_caps_get_free_size(MALLOC_CAP_8BIT | MALLOC_CAP_INTERNAL);
                if (freeInternalHeap < kMinFreeInternalHeap)
                {
                    ESP_LOGW(TAG, "Not creating '%s': low internal heap (%u bytes free, threshold %u bytes)", deviceType.c_str(),
                             static_cast<unsigned int>(freeInternalHeap), static_cast<unsigned int>(kMinFreeInternalHeap));
                    skippedCount++;
                    continue;
                }

                auto bridgedNode = deviceFactory.Create("bridged-node", KebabCaseToTitleCase(deviceType));
                if (bridgedNode == nullptr)
                {
                    ESP_LOGE(TAG, "Failed to create bridged-node for '%s'", deviceType.c_str());
                    skippedCount++;
                    continue;
                }
                EndpointId bnEp = endpointIdAllocator.Allocate();
                endpointIdAllocator.ForceNext(bnEp);
                ESP_LOGI(TAG, "Registering bridged-node for '%s' on endpoint %u (parent %u)", deviceType.c_str(), bnEp,
                         aggregatorEp);
                err = bridgedNode->Register(endpointIdAllocator, dataModelProvider, EndpointComposition::WithParent(aggregatorEp));
                if (err != CHIP_NO_ERROR)
                {
                    ESP_LOGE(TAG, "Failed to register bridged-node for '%s' on endpoint %u: %" CHIP_ERROR_FORMAT,
                             deviceType.c_str(), bnEp, err.Format());
                    skippedCount++;
                    continue;
                }

                auto device = deviceFactory.Create(deviceType);
                if (device == nullptr)
                {
                    ESP_LOGE(TAG, "Failed to create device '%s'", deviceType.c_str());
                    skippedCount++;
                    continue;
                }
                ESP_LOGI(TAG, "Registering device '%s' with parent %u", deviceType.c_str(), bnEp);
                err = device->Register(endpointIdAllocator, dataModelProvider, EndpointComposition::WithParent(bnEp));
                if (err != CHIP_NO_ERROR)
                {
                    ESP_LOGE(TAG, "Failed to register device '%s' with parent %u: %" CHIP_ERROR_FORMAT, deviceType.c_str(), bnEp,
                             err.Format());
                    skippedCount++;
                    continue;
                }

                auto oobAccessor = deviceFactory.CreateAccessor(deviceType, *device);
                if (oobAccessor)
                {
                    OOBAccessorRegistry::Instance().Register(*oobAccessor);
                    gConstructedAccessors.push_back(std::move(oobAccessor));
                }

                gConstructedDevices.push_back(std::move(bridgedNode));
                gConstructedDevices.push_back(std::move(device));
                createdCount++;
            }
            ESP_LOGI(TAG,
                     "Aggregator initialization complete: %u bridged devices created, %u devices skipped (remaining internal heap: "
                     "%u bytes)",
                     createdCount, skippedCount,
                     static_cast<unsigned int>(heap_caps_get_free_size(MALLOC_CAP_8BIT | MALLOC_CAP_INTERNAL)));
        }
        else
        {
            auto defaultDevName = deviceFactory.GetDefaultDevice();
            auto device         = deviceFactory.Create(defaultDevName);
            if (device == nullptr)
            {
                ESP_LOGE(TAG, "Failed to create default device %s", defaultDevName.c_str());
                return nullptr;
            }
            endpointIdAllocator.ForceNext(CONFIG_ALL_DEVICES_ENDPOINT);
            ESP_LOGI(TAG, "Registering default device '%s' on endpoint %u", defaultDevName.c_str(),
                     static_cast<unsigned int>(CONFIG_ALL_DEVICES_ENDPOINT));
            err = device->Register(endpointIdAllocator, dataModelProvider);
            if (err != CHIP_NO_ERROR)
            {
                ESP_LOGE(TAG, "Failed to register default device '%s': %" CHIP_ERROR_FORMAT, defaultDevName.c_str(), err.Format());
                return nullptr;
            }
            gConstructedDevices.push_back(std::move(device));
        }
    }
    else
    {
        if (gDeviceType.empty() || !deviceFactory.IsValidDevice(gDeviceType))
        {
            gDeviceType = deviceFactory.GetDefaultDevice();
        }
        auto device = deviceFactory.Create(gDeviceType);
        if (device == nullptr)
        {
            ESP_LOGE(TAG, "Failed to create device of type: %s", gDeviceType.c_str());
            return nullptr;
        }

        endpointIdAllocator.ForceNext(CONFIG_ALL_DEVICES_ENDPOINT);
        ESP_LOGI(TAG, "Registering device '%s' on endpoint %u", gDeviceType.c_str(),
                 static_cast<unsigned int>(CONFIG_ALL_DEVICES_ENDPOINT));
        err = device->Register(endpointIdAllocator, dataModelProvider);
        if (err != CHIP_NO_ERROR)
        {
            ESP_LOGE(TAG, "Failed to register device '%s': %" CHIP_ERROR_FORMAT, gDeviceType.c_str(), err.Format());
            return nullptr;
        }

        auto oobAccessor = deviceFactory.CreateAccessor(gDeviceType, *device);
        if (oobAccessor)
        {
            OOBAccessorRegistry::Instance().Register(*oobAccessor);
            gConstructedAccessors.push_back(std::move(oobAccessor));
        }

        gConstructedDevices.push_back(std::move(device));
    }

    return &dataModelProvider;
}

void InitServer(intptr_t context)
{
    static chip::CommonCaseDeviceServerInitParams initParams;
    CHIP_ERROR err = initParams.InitializeStaticResourcesBeforeServerInit();
    if (err != CHIP_NO_ERROR)
    {
        ESP_LOGE(TAG, "InitializeStaticResourcesBeforeServerInit() failed: %" CHIP_ERROR_FORMAT, err.Format());
        return;
    }

    // Initialize the test event trigger delegate
    static SimpleTestEventTriggerDelegate sTestEventTriggerDelegate;
    initParams.testEventTriggerDelegate = &sTestEventTriggerDelegate;

