project-chip/connectedhomeip/examples/all-devices-app/esp32/main/main.cpp
    DeviceFactory::GetInstance().Init(DeviceFactory::Context{
        .groupDataProvider        = gGroupDataProvider,                     //
        .fabricTable              = Server::GetInstance().GetFabricTable(), //
        .timerDelegate            = gTimerDelegate,                         //
        .storageDelegate          = *initParams.persistentStorageDelegate,  //
        .diagnosticDataProvider   = DeviceLayer::GetDiagnosticDataProvider(),
        .platformManager          = DeviceLayer::PlatformMgr(),
        .failSafeContext          = Server::GetInstance().GetFailSafeContext(),
        .bindingTable             = Clusters::Binding::Table::GetInstance(),
        .bindingManager           = Clusters::Binding::Manager::GetInstance(),
        .testEventTriggerDelegate = *initParams.testEventTriggerDelegate,
        .identifyDelegate         = gIdentifyDelegate,
    });

#if ALL_DEVICES_ENABLE_DIMMABLE_LIGHT
    // Override dimmable-light with ESP32 hardware implementation that drives a real LED
    DeviceFactory::GetInstance().RegisterCreator("dimmable-light", [&]() {
        return std::make_unique<ESP32DimmableLight>(ESP32DimmableLight::Context{
            .groupDataProvider = gGroupDataProvider,
            .fabricTable       = Server::GetInstance().GetFabricTable(),
            .timerDelegate     = gTimerDelegate,
            .identifyDelegate  = gIdentifyDelegate,
        });
    });
#endif

    RegisterDeviceFactoryOverrides(gTimerDelegate, initParams.persistentStorageDelegate);

    initParams.groupDataProvider = &gGroupDataProvider;
    gGroupDataProvider.SetStorageDelegate(initParams.persistentStorageDelegate);
    gGroupDataProvider.SetSessionKeystore(initParams.sessionKeystore);
    SuccessOrDie(gGroupDataProvider.Init());
    Credentials::SetGroupDataProvider(&gGroupDataProvider);

    initParams.dataModelProvider =
        PopulateCodeDrivenDataModelProvider(initParams.persistentStorageDelegate, initParams.testEventTriggerDelegate);
    initParams.operationalServicePort        = CHIP_PORT;
    initParams.userDirectedCommissioningPort = CHIP_UDC_PORT;

    if (initParams.dataModelProvider == nullptr)
    {
        ESP_LOGE(TAG, "Failed to populate data model provider");
        return;
    }

    // Save device type to NVS only after successful device creation
    err = ESP32Config::WriteConfigValueStr(kConfigKey_DeviceType, gDeviceType.c_str());
    if (err != CHIP_NO_ERROR)
    {
        ESP_LOGW(TAG, "Failed to save device type to NVS: %" CHIP_ERROR_FORMAT, err.Format());
    }
    else
    {
        ESP_LOGI(TAG, "Device type '%s' saved to NVS", gDeviceType.c_str());
    }

    err = Server::GetInstance().Init(initParams);
    if (err != CHIP_NO_ERROR)
    {
        ESP_LOGE(TAG, "Server init failed: %" CHIP_ERROR_FORMAT, err.Format());
        return;
    }

#if CHIP_DEVICE_CONFIG_ENABLE_WIFI && CONFIG_ENABLE_CHIP_SHELL
    chip::Shell::SetWiFiDriver(&sWiFiDriver);
#endif
}

} // namespace

void InitServerWithDeviceType(std::string deviceType)
{
    // Set the device type (store the actual string, not a pointer to temporary)
    gDeviceType = std::move(deviceType);

    // Init the server
    SuccessOrDie(PlatformMgr().ScheduleWork(InitServer, reinterpret_cast<intptr_t>(nullptr)));
}

const std::string & GetActiveDeviceType()
{
    return gDeviceType;
}

void SetDeviceTypeAndRestart(const std::string & deviceType)
{
    ESP_LOGI(TAG, "Saving device type '%s' to NVS and restarting...", deviceType.c_str());
    CHIP_ERROR err = ESP32Config::WriteConfigValueStr(kConfigKey_DeviceType, deviceType.c_str());
    if (err != CHIP_NO_ERROR)
    {
        ESP_LOGE(TAG, "Failed to save device type to NVS: %" CHIP_ERROR_FORMAT, err.Format());
    }

#if CONFIG_HAVE_DISPLAY
    TFT_fillScreen(TFT_BLACK);
    TFT_setFont(DEJAVU24_FONT, nullptr);
    tft_fg = ScreenNormalColor;
    TFT_print("Restarting...", 40, DisplayHeight / 2 - 20);
#endif

    vTaskDelay(pdMS_TO_TICKS(300));
    esp_restart();
}

extern "C" void app_main()
{
    // Initialize the ESP NVS layer.
    esp_err_t err = nvs_flash_init();
    if (err != ESP_OK)
    {
        ESP_LOGE(TAG, "nvs_flash_init() failed: %s", esp_err_to_name(err));
        return;
    }
    err = esp_event_loop_create_default();
    if (err != ESP_OK)
    {
        ESP_LOGE(TAG, "esp_event_loop_create_default() failed: %s", esp_err_to_name(err));
        return;
    }

    ESP_LOGI(TAG, "==================================================");
    ESP_LOGI(TAG, "chip-esp32-all-devices-app starting");
    ESP_LOGI(TAG, "==================================================");

#if CHIP_DEVICE_CONFIG_ENABLE_WIFI
    if (DeviceLayer::Internal::ESP32Utils::InitWiFiStack() != CHIP_NO_ERROR)
    {
        ESP_LOGE(TAG, "Failed to initialize WiFi stack");
        return;
    }
#endif // CHIP_DEVICE_CONFIG_ENABLE_WIFI

    DeviceLayer::SetDeviceInfoProvider(&gExampleDeviceInfoProvider);

    CHIP_ERROR error = chip::Platform::MemoryInit();
    if (error != CHIP_NO_ERROR)
    {
        ESP_LOGE(TAG, "Platform::MemoryInit() failed: %" CHIP_ERROR_FORMAT, error.Format());
        return;
    }

    error = PlatformMgr().InitChipStack();
    if (error != CHIP_NO_ERROR)
    {
        ESP_LOGE(TAG, "PlatformMgr().InitChipStack() failed: %" CHIP_ERROR_FORMAT, error.Format());
        return;
    }

    // Register event handler to restart DNS-SD on connectivity change
    SuccessOrDie(PlatformMgr().AddEventHandler(DeviceEventHandler, 0));

#if CONFIG_ENABLE_ESP32_FACTORY_DATA_PROVIDER
    SetCommissionableDataProvider(&sFactoryDataProvider);
#if CONFIG_ENABLE_ESP32_DEVICE_INSTANCE_INFO_PROVIDER
    SetDeviceInstanceInfoProvider(&sFactoryDataProvider);
#endif
    SetDeviceAttestationCredentialsProvider(&sFactoryDataProvider);
#else
    SetDeviceAttestationCredentialsProvider(Examples::GetExampleDACProvider());
#endif // CONFIG_ENABLE_ESP32_FACTORY_DATA_PROVIDER

    // Print onboarding codes (QR code URL and manual code)
    PrintOnboardingCodes(chip::RendezvousInformationFlags(CONFIG_RENDEZVOUS_MODE));

