project-chip/connectedhomeip/examples/all-devices-app/esp32/main/main.cpp
#if CONFIG_HAVE_DISPLAY
    InitDeviceDisplay();
#endif // CONFIG_HAVE_DISPLAY

    error = PlatformMgr().StartEventLoopTask();
    if (error != CHIP_NO_ERROR)
    {
        ESP_LOGE(TAG, "PlatformMgr().StartEventLoopTask() failed: %" CHIP_ERROR_FORMAT, error.Format());
        return;
    }

    // Check if device type is stored in NVS from a previous boot
    char storedDeviceType[kMaxDeviceTypeLength] = { 0 };
    size_t storedLen                            = 0;
    CHIP_ERROR nvsErr =
        ESP32Config::ReadConfigValueStr(kConfigKey_DeviceType, storedDeviceType, sizeof(storedDeviceType), storedLen);

#if CONFIG_ENABLE_CHIP_SHELL
    chip::LaunchShell();
    chip::Shell::DeviceCommands::GetInstance().Register();
#endif // CONFIG_ENABLE_CHIP_SHELL

    if (nvsErr == CHIP_NO_ERROR && storedLen > 0)
    {
        ESP_LOGI(TAG, "==================================================");
        ESP_LOGI(TAG, "Found stored device type: %s", storedDeviceType);
        ESP_LOGI(TAG, "Auto-initializing...");
        ESP_LOGI(TAG, "==================================================");
        InitServerWithDeviceType(std::string(storedDeviceType));
    }
    else
    {
        ESP_LOGI(TAG, "==================================================");
        ESP_LOGI(TAG, "No stored device type found, defaulting to all bridged devices (*)");
        ESP_LOGI(TAG, "Auto-initializing...");
        ESP_LOGI(TAG, "==================================================");
        InitServerWithDeviceType("*");
    }
}
